# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\sepp2\Desktop\Schule\DIC\4BHEL\In_Bearbeitung\PSOC\Synthie\Synthesizer.cydsn\Synthesizer.cyprj
# Date: Sun, 20 Apr 2025 19:41:49 GMT
#set_units -time ns
create_clock -name {WaveDAC8_1_DacClk(routed)} -period 2500 -waveform {0 1250} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {WaveDAC8_3_DacClk(routed)} -period 2500 -waveform {0 1250} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {WaveDAC8_4_DacClk(routed)} -period 2500 -waveform {0 1250} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {WaveDAC8_2_DacClk(routed)} -period 2500 -waveform {0 1250} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {WaveDAC8_1_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61 121} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {WaveDAC8_3_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61 121} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {WaveDAC8_4_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61 121} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {WaveDAC8_2_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61 121} [list [get_pins {ClockBlock/dclk_glb_3}]]


# Component constraints for C:\Users\sepp2\Desktop\Schule\DIC\4BHEL\In_Bearbeitung\PSOC\Synthie\Synthesizer.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\sepp2\Desktop\Schule\DIC\4BHEL\In_Bearbeitung\PSOC\Synthie\Synthesizer.cydsn\Synthesizer.cyprj
# Date: Sun, 20 Apr 2025 19:41:44 GMT
